       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM02001.
      ******************************************************************
      * AUTHOR: MARCIA GAMELEIRA
      * OBJETIVO: TESTE
      * DATA: 28/11/2023
      ******************************************************************
       ENVIRONMENT DIVISION.

      ******************************************************************
       DATA DIVISION.
       WORKING-STORAGE SECTION.

      ******************************************************************
       PROCEDURE DIVISION.
           DISPLAY "HELLO WORLD!".

       END PROGRAM PGM02001.
