       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
      ******************************************************************
      * AUTHOR: MARCIA GAMELEIRA
      * OBJETIVO: MOSTRAR A STRING HELLO ALURA
      * DATA: 25/10/2023
      ******************************************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY "HELLO ALURA".
           STOP RUN.
       END PROGRAM PROGCOB01.
