       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB10.
      ******************************************************************
      * AUTHOR: MARCIA GAMELEIRA
      * OBJETIVO: UTILIZANDO VARIÁVEL NÍVEL 88
      * DATA: 28/10/2023
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

      ******************************************************************
       DATA DIVISION.
       WORKING-STORAGE SECTION.


      ******************************************************************
       PROCEDURE DIVISION.



           STOP RUN.
       END PROGRAM PROGCOB10.
