       77 WRK-NOME     PIC X(30)    VALUE SPACES.
       77 WRK-IDADE    PIC 9(3)     VALUES ZEROS.
       77 WRK-SALARIO  PIC 9(5)V99  VALUES ZEROS.
