       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA01.
      *==========================================================
      *== AUTOR: MARCIA GAMELEIRA
      *== OBJETIVO: PRIMEIRO COONTATO COM COBOL
      *== DATA: 08/10/2023
      *== OBSERVACOES:
      *==========================================================

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE SECTION.
           DISPLAY "Hello world"
           DISPLAY "Marcinha"
           STOP RUN.
       END PROGRAM PROGRAMA01.
