       IDENTIFICATION DIVISION.
       PROGRAM-ID. NOME-DO-PROGRAMA.
      *==========================================================
      *== AUTOR: MARCIA GAMELEIRA
      *== OBJETIVO: MODELO BASE.
      *== DATA:
      *== OBSERVACOES:
      *==========================================================

       ENVIRONMENT DIVISION.
       CONFIGURATION   SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.


       PROCEDURE DIVISION.

           STOP RUN.

       END PROGRAM NOME-DO-PROGRAMA.
