      * Autor: Marcia Gameleira
      * Data:
      * Objetivo:

      *                                        IDENTIFICATION DIVISION
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGMXXXXX.

      *                                           ENVIRONMENT DIVISION
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       INPUT-OUTPUT SECTION.

      *                                                  DATA DIVISION
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.


      *                                             PROCEDURE DIVISION
       PROCEDURE DIVISION.


            STOP RUN.

       END PROGRAM PGMXXXXX.
