       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB08.
      ******************************************************************
      * AUTHOR: MARCIA GAMELEIRA
      * OBJETIVO: COMANDO EVALUATE.
      *           EXEMPLO COM CÁLCULO DE FRETE.
      * DATA: 28/10/2023
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

      ******************************************************************
       DATA DIVISION.
       WORKING-STORAGE SECTION.


      ******************************************************************
       PROCEDURE DIVISION.


           STOP RUN.
       END PROGRAM PROGCOB08.
