       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG06.
      *==========================================================
      *== AUTOR: MARCIA GAMELEIRA
      *== OBJETIVO: OPERADORES ARITMETICOS.
      *== DATA: 02/11/2023
      *== OBSERVACOES:
      *==========================================================

       ENVIRONMENT DIVISION.
       CONFIGURATION   SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NUMBER1      PIC 9(6)        VALUE ZEROS.
       77 WRK-NUMBER2      PIC 9(6)        VALUE ZEROS.
       77 WRK-RESULT       PIC 9(8)        VALUE ZEROS.
       77 WRK-RESULT-FORM  PIC ZZ.ZZZ.ZZ9  VALUE ZEROS.

       PROCEDURE DIVISION.
       0001-ENTRADA-DE-DADOS       SECTION.
           DISPLAY "DIGITE O PRIMEIRO OPERANDO: "
            ACCEPT WRK-NUMBER1
           DISPLAY "DIGITE O SEGUNDO OPERANDO: "
            ACCEPT WRK-NUMBER2.

       0002-PROCESSAMENTO          SECTION.
           ADD WRK-NUMBER1 WRK-NUMBER2 TO WRK-RESULT
            MOVE WRK-RESULT TO WRK-RESULT-FORM
            DISPLAY "SOMA: "WRK-RESULT-FORM
           SUBTRACT WRK-NUMBER2 FROM WRK-NUMBER1 GIVING WRK-RESULT
            MOVE WRK-RESULT TO WRK-RESULT-FORM
            DISPLAY "SUBTRACAO: "WRK-RESULT-FORM
           MULTIPLY WRK-NUMBER1 BY WRK-NUMBER2 GIVING WRK-RESULT
            MOVE WRK-RESULT TO WRK-RESULT-FORM
            DISPLAY "MULTIPLICACAO: "WRK-RESULT-FORM
           DIVIDE WRK-NUMBER1 BY WRK-NUMBER2 GIVING WRK-RESULT
            MOVE WRK-RESULT TO WRK-RESULT-FORM
            DISPLAY "DIVISAO: "WRK-RESULT-FORM.

       0003-FINALIZACAO       SECTION.
           STOP RUN.

       END PROGRAM PROG06.
