       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG11.
      *-----------------------------------------------------------------
      *== AUTOR: MARCIA GAMELEIRA
      *== OBJETIVO: TRABALHANDO COM VETORES.
      *== DATA: 10/11/2023
      *== OBSERVACOES:
      *-----------------------------------------------------------------

      *=================================================================
       ENVIRONMENT DIVISION.
       CONFIGURATION   SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
      *=================================================================
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOME         PIC X(30)       OCCURS 5 TIMES.

      *=================================================================
       PROCEDURE DIVISION.





       END PROGRAM PROG11.
