       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG11.
      *-----------------------------------------------------------------
      *== AUTOR: MARCIA GAMELEIRA
      *== OBJETIVO: CLÁUSULA REDEFINES.
      *== DATA: 10/11/2023
      *== OBSERVACOES:
      *-----------------------------------------------------------------

      *=================================================================
       ENVIRONMENT DIVISION.
       CONFIGURATION   SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
      *=================================================================
       DATA DIVISION.
       WORKING-STORAGE SECTION.

      *=================================================================
       PROCEDURE DIVISION.



       END PROGRAM PROG11.
